In [1]:
import pandas as pd
import numpy as np

In [2]:
#squeeze = True. --> convertir el df a una pandas Series
iris = pd.read_csv("iris.csv", usecols = ["species"], squeeze = True)
iris

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [3]:
google = pd.read_csv("google_stock_price.csv", usecols = ["Stock Price"], squeeze = True)
google

0        50.12
1        54.10
2        54.65
3        52.38
4        52.95
         ...
3007    772.88
3008    771.07
3009    773.18
3010    771.61
3011    782.22
Name: Stock Price, Length: 3012, dtype: float64

In [22]:
sorted(google,reverse = True) #nos regresa una lista, NO UNA SERIE

[782.22,
 776.6,
 773.18,
 772.88,
 771.61,
 771.07,
 771.0,
 768.79,
 767.04,
 766.81,
 766.61,
 764.65,
 763.25,
 762.51,
 762.38,
 762.37,
 759.14,
 759.0,
 758.88,
 758.09,
 756.6,
 755.98,
 753.93,
 753.2,
 752.67,
 752.54,
 752.0,
 751.72,
 751.61,
 750.53,
 750.31,
 750.26,
 750.0,
 749.91,
 749.46,
 749.43,
 748.4,
 748.28,
 748.15,
 747.77,
 747.77,
 745.91,
 745.69,
 745.29,
 744.95,
 744.77,
 743.62,
 743.4,
 743.09,
 742.95,
 742.74,
 742.6,
 742.58,
 742.09,
 741.84,
 741.77,
 741.19,
 740.75,
 740.28,
 740.0,
 739.77,
 739.31,
 739.15,
 738.87,
 738.63,
 738.42,
 738.41,
 738.06,
 737.8,
 737.78,
 737.6,
 736.96,
 736.1,
 736.09,
 735.72,
 735.4,
 735.3,
 734.15,
 733.78,
 733.76,
 733.53,
 732.66,
 731.25,
 731.23,
 730.96,
 730.49,
 730.4,
 728.96,
 728.58,
 728.33,
 728.32,
 728.28,
 728.11,
 726.95,
 726.82,
 726.39,
 726.07,
 725.3,
 725.27,
 725.25,
 724.89,
 724.12,
 723.18,
 723.15,
 722.34,
 722.16,
 721.11,
 720.95,
 720.64,
 720.09,
 719.85,
 719.41,
 718.92,
 718.85,
 718.81,
 718.77,
 718.36,
 718.27,
 717.0,
 716.98,
 716.92,
 716.65,
 716.55,
 716.49,
 716.03,
 715.29,
 715.09,
 714.72,
 714.47,
 713.31,
 713.04,
 712.95,
 712.9,
 712.82,
 712.78,
 712.42,
 711.67,
 711.12,
 710.89,
 710.83,
 710.81,
 710.36,
 709.74,
 708.49,
 708.4,
 708.14,
 708.01,
 706.63,
 706.59,
 706.46,
 706.23,
 705.84,
 705.75,
 705.63,
 705.24,
 705.07,
 704.24,
 702.0,
 701.87,
 701.79,
 701.43,
 700.91,
 700.56,
 700.32,
 699.99,
 699.56,
 699.21,
 698.45,
 698.21,
 697.77,
 697.77,
 697.46,
 697.35,
 695.94,
 695.85,
 695.7,
 695.36,
 695.16,
 694.49,
 694.45,
 693.97,
 693.71,
 693.01,
 692.36,
 692.1,
 691.72,
 691.02,
 691.0,
 684.12,
 684.11,
 683.57,
 683.11,
 682.74,
 682.4,
 680.04,
 678.11,
 675.22,
 672.93,
 668.26,
 666.1,
 663.02,
 662.3,
 662.2,
 662.1,
 661.74,
 660.9,
 660.87,
 660.78,
 659.56,
 657.12,
 656.45,
 656.13,
 652.3,
 651.79,
 651.16,
 650.28,
 646.83,
 646.67,
 645.44,
 644.28,
 643.78,
 643.61,
 642.9,
 642.68,
 642.61,
 642.36,
 641.47,
 639.16,
 637.61,
 635.98,
 635.44,
 635.3,
 635.14,
 633.73,
 632.59,
 631.93,
 631.21,
 630.38,
 629.25,
 629.25,
 628.62,
 628.0,
 627.26,
 626.91,
 625.8,
 625.77,
 625.61,
 623.56,
 623.24,
 622.69,
 622.36,
 621.35,
 618.25,
 614.66,
 614.34,
 612.72,
 612.48,
 611.97,
 611.29,
 609.47,
 609.39,
 609.2,
 609.0,
 608.52,
 608.42,
 607.22,
 606.85,
 606.79,
 606.25,
 605.65,
 605.18,
 605.02,
 604.83,
 603.05,
 601.45,
 601.29,
 600.8,
 600.74,
 600.7,
 600.57,
 599.4,
 599.35,
 599.03,
 597.98,
 597.79,
 596.08,
 595.98,
 595.45,
 595.08,
 594.97,
 594.89,
 594.74,
 594.49,
 593.94,
 593.35,
 592.75,
 590.93,
 590.6,
 589.89,
 589.72,
 589.61,
 589.47,
 589.27,
 589.02,
 588.13,
 587.99,
 587.42,
 587.37,
 586.86,
 586.08,
 585.88,
 585.81,
 585.61,
 584.87,
 584.78,
 584.77,
 584.73,
 584.49,
 583.37,
 583.1,
 582.67,
 582.66,
 582.56,
 582.34,
 582.25,
 582.16,
 582.06,
 581.98,
 581.93,
 581.35,
 581.27,
 581.13,
 581.01,
 580.2,
 579.95,
 579.85,
 579.47,
 579.4,
 579.18,
 578.78,
 578.65,
 578.39,
 577.94,
 577.86,
 577.53,
 577.36,
 577.35,
 577.33,
 577.24,
 577.1,
 576.36,
 576.08,
 576.0,
 575.62,
 575.33,
 575.28,
 575.28,
 575.06,
 574.78,
 574.69,
 574.65,
 574.13,
 573.74,
 573.73,
 573.64,
 573.48,
 573.37,
 573.15,
 573.1,
 572.5,
 571.6,
 571.6,
 571.34,
 571.1,
 571.09,
 571.03,
 571.0,
 570.19,
 570.08,
 570.04,
 569.74,
 569.2,
 568.86,
 568.85,
 568.77,
 568.51,
 568.27,
 567.88,
 567.68,
 567.13,
 566.98,
 566.88,
 566.37,
 566.15,
 566.07,
 565.95,
 565.42,
 565.07,
 565.06,
 564.95,
 564.62,
 564.55,
 564.52,
 564.14,
 563.74,
 563.36,
 562.73,
 562.12,
 561.68,
 561.35,
 561.1,
 560.94,
 560.93,
 560.88,
 560.55,
 560.36,
 560.22,
 560.08,
 559.89,
 559.79,
 559.51,
 559.5,
 559.08,
 558.84,
 558.81,
 558.78,
 558.64,
 558.4,
 558.17,
 558.1,
 557.99,
 556.99,
 556.7,
 556.58,
 556.54,
 556.36,
 556.33,
 556.0,
 555.51,
 555.48,
 555.37,
 555.36,
 555.22,
 555.17,
 555.01,
 554.9,
 554.9,
 554.51,
 554.18,
 554.11,
 553.93,
 553.9,
 553.68,
 553.37,
 552.91,
 552.7,
 552.03,
 551.95,
 551.76,
 551.35,
 551.18,
 550.84,
 550.31,
 550.29,
 550.06,
 549.76,
 549.33,
 549.08,
 549.01,
 548.9,
 548.34,
 548.0,
 547.49,
 547.32,
 547.31,
 547.0,
 546.55,
 545.92,
 545.38,
 545.06,
 544.94,
 544.66,
 544.49,
 544.4,
 544.28,
 543.98,
 543.87,
 543.14,
 543.01,
 542.93,
 542.87,
 542.84,
 542.57,
 542.56,
 542.51,
 542.04,
 541.83,
 541.83,
 541.79,
 541.61,
 541.08,
 541.01,
 540.95,
 540.78,
 540.78,
 540.77,
 540.48,
 540.37,
 540.31,
 540.11,
 540.01,
 539.95,
 539.79,
 539.78,
 539.78,
 539.7,
 539.36,
 539.27,
 539.27,
 539.18,
 539.17,
 538.95,
 538.94,
 538.53,
 538.4,
 538.22,
 538.19,
 538.15,
 538.11,
 537.94,
 537.9,
 537.84,
 537.5,
 537.36,
 537.34,
 537.31,
 537.02,
 536.99,
 536.94,
 536.76,
 536.73,
 536.7,
 536.69,
 536.69,
 536.51,
 536.44,
 536.1,
 536.09,
 535.97,
 535.95,
 535.7,
 535.53,
 535.38,
 535.23,
 535.21,
 535.03,
 534.83,
 534.81,
 534.61,
 534.52,
 534.45,
 534.4,
 534.4,
 534.39,
 534.03,
 533.99,
 533.97,
 533.85,
 533.8,
 533.8,
 533.75,
 533.37,
 533.33,
 533.21,
 533.09,
 532.71,
 532.53,
 532.52,
 532.33,
 532.32,
 532.3,
 532.11,
 531.91,
 531.69,
 531.35,
 531.32,
 531.02,
 531.0,
 530.8,
 530.7,
 530.6,
 530.59,
 530.42,
 530.39,
 530.33,
 530.13,
 530.03,
 529.92,
 529.86,
 529.77,
 529.62,
 529.27,
 529.26,
 529.24,
 529.04,
 528.86,
 528.77,
 528.68,
 528.62,
 528.56,
 528.48,
 528.34,
 528.15,
 528.14,
 527.93,
 527.83,
 527.81,
 527.7,
 527.58,
 527.2,
 526.98,
 526.94,
 526.83,
 526.71,
 526.69,
 526.66,
 526.65,
 526.54,
 526.4,
 526.1,
 526.06,
 525.26,
 525.16,
 525.02,
 524.87,
 524.81,
 524.51,
 524.22,
 524.05,
 523.4,
 522.86,
 522.76,
 522.44,
 521.84,
 521.52,
 520.84,
 520.68,
 520.63,
 520.51,
 519.98,
 518.73,
 518.66,
 518.63,
 518.04,
 517.6,
 517.15,
 517.1,
 516.83,
 516.52,
 516.35,
 516.26,
 516.18,
 515.72,
 515.43,
 515.26,
 515.19,
 515.14,
 514.77,
 514.69,
 513.87,
 513.8,
 513.01,
 512.54,
 512.26,
 512.09,
 511.17,
 511.1,
 511.0,
 510.86,
 510.66,
 510.64,
 510.25,
 510.0,
 509.96,
 508.08,
 507.51,
 507.09,
 506.99,
 506.9,
 505.38,
 505.2,
 504.89,
 504.79,
 503.47,
 503.0,
 502.68,
 501.96,
 501.79,
 501.15,
 501.1,
 500.87,
 496.18,
 496.17,
 495.39,
 492.55,
 461.88,
 461.04,
 459.66,
 459.34,
 458.82,
 457.49,
 454.89,
 454.88,
 454.14,
 453.81,
 453.03,
 452.83,
 452.54,
 452.17,
 452.09,
 452.05,
 451.66,
 451.48,
 451.45,
 451.21,
 451.1,
 451.0,
 449.89,
 449.86,
 448.75,
 448.56,
 447.85,
 447.84,
 447.65,
 446.3,
 446.08,
 445.88,
 445.01,
 444.88,
 444.76,
 444.66,
 444.27,
 444.09,
 443.95,
 443.89,
 443.58,
 443.55,
 443.5,
 443.44,
 443.43,
 443.41,
 443.11,
 443.06,
 442.98,
 442.81,
 442.77,
 442.68,
 442.61,
 442.31,
 442.23,
 441.93,
 440.95,
 440.71,
 440.69,
 440.56,
 440.19,
 440.18,
 440.02,
 439.74,
 439.67,
 439.47,
 439.43,
 439.35,
 439.34,
 438.65,
 438.33,
 438.18,
 438.1,
 438.06,
 437.76,
 437.62,
 437.61,
 437.52,
 437.08,
 436.42,
 436.39,
 436.38,
 436.22,
 435.74,
 435.56,
 435.55,
 435.38,
 435.3,
 435.17,
 434.94,
 434.67,
 434.47,
 434.46,
 434.23,
 433.72,
 433.69,
 433.38,
 432.76,
 432.67,
 432.44,
 432.39,
 432.28,
 431.89,
 430.34,
 429.76,
 429.42,
 429.4,
 429.12,
 428.19,
 428.03,
 427.5,
 427.29,
 426.41,
 424.65,
 423.85,
 423.03,
 422.44,
 418.88,
 416.99,
 415.88,
 415.34,
 415.27,
 414.39,
 413.39,
 412.24,
 411.87,
 410.36,
 410.34,
 409.8,
 409.12,
 406.95,
 406.74,
 406.32,
 406.11,
 405.8,
 405.25,
 405.22,
 404.75,
 404.42,
 404.15,
 403.55,
 403.49,
 403.02,
 402.7,
 402.69,
 400.93,
 400.31,
 400.2,
 400.19,
 399.66,
 399.54,
 399.49,
 399.46,
 397.37,
 397.14,
 396.7,
 396.29,
 396.05,
 395.83,
 394.99,
 394.8,
 394.69,
 394.67,
 394.63,
 393.52,
 392.29,
 391.13,
 391.04,
 390.89,
 390.82,
 390.57,
 389.96,
 388.44,
 387.4,
 387.04,
 386.59,
 384.7,
 383.64,
 383.44,
 382.57,
 382.49,
 380.87,
 380.51,
 379.13,
 378.54,
 378.12,
 377.87,
 377.47,
 377.37,
 376.87,
 376.54,
 376.54,
 376.46,
 376.46,
 376.35,
 375.36,
 374.99,
 374.32,
 374.21,
 372.0,
 371.98,
 371.91,
 371.67,
 370.52,
 370.38,
 370.37,
 370.12,
 369.62,
 368.69,
 368.62,
 367.01,
 366.63,
 366.28,
 366.1,
 363.69,
 363.39,
 362.46,
 362.1,
 361.47,
 361.26,
 361.26,
 360.82,
 360.17,
 360.03,
 359.69,
 358.85,
 358.78,
 357.46,
 357.27,
 357.24,
 357.08,
 355.3,
 355.27,
 355.06,
 354.64,
 354.49,
 354.4,
 354.08,
 353.34,
 353.15,
 352.79,
 352.72,
 352.67,
 351.9,
 351.25,
 351.08,
 351.0,
 350.91,
 350.63,
 350.03,
 350.02,
 350.01,
 349.65,
 349.35,
 349.33,
 349.25,
 348.91,
 348.84,
 348.43,
 348.15,
 348.09,
 348.0,
 347.28,
 347.15,
 347.04,
 346.68,
 346.57,
 346.15,
 345.78,
 345.75,
 345.6,
 345.39,
 345.22,
 345.17,
 345.1,
 344.64,
 344.5,
 343.66,
 343.62,
 343.57,
 343.45,
 342.37,
 342.32,
 342.25,
 342.2,
 341.76,
 341.74,
 341.49,
 341.14,
 340.55,
 340.52,
 340.5,
 340.42,
 340.18,
 340.02,
 ...]

In [21]:
sorted(google)

AttributeError: 'list' object has no attribute 'head'

In [6]:
google.count() #cuenta los valores NO NULOS

3012

In [7]:
google.size # size cuenta INCLUSO LOS NULOS.

3012

In [23]:
lista = [1, np.nan,3, 4]

In [24]:
lista

[1, nan, 3, 4]

In [10]:
sl = pd.Series(lista)
sl

0    1.0
1    NaN
2    3.0
3    4.0
dtype: float64

In [11]:
sl.count()

3

In [13]:
sl.value_counts().sum()

3

### Método sort_values()

In [16]:
google.sort_values(ascending = False).head()

3011    782.22
2859    776.60
3009    773.18
3007    772.88
3010    771.61
Name: Stock Price, dtype: float64

In [17]:
google

0        50.12
1        54.10
2        54.65
3        52.38
4        52.95
         ...
3007    772.88
3008    771.07
3009    773.18
3010    771.61
3011    782.22
Name: Stock Price, Length: 3012, dtype: float64

In [18]:
google.sort_values(ascending = False, inplace = True)

In [19]:
google.head()

3011    782.22
2859    776.60
3009    773.18
3007    772.88
3010    771.61
Name: Stock Price, dtype: float64

In [27]:
iris[[4,7,11]]

4     setosa
7     setosa
11    setosa
Name: species, dtype: object

In [29]:
list(iris)[-1]

'virginica'

In [30]:
## Extraer valores mediante las ETIQUETAS DEL ÍNDICE
## iris_id

In [37]:
iris_id = pd.read_csv("iris_id.csv", usecols = ["id","species"],index_col = "id", squeeze = True)

In [38]:
iris_id.head()

id
A1    setosa
A2    setosa
A3    setosa
A4    setosa
A5    setosa
Name: species, dtype: object

In [39]:
iris_id.index

Index(['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'A10',
       ...
       'A141', 'A142', 'A143', 'A144', 'A145', 'A146', 'A147', 'A148', 'A149',
       'A150'],
      dtype='object', name='id', length=150)

In [40]:
#EXTRAYENDO mediante las etiquetas del índice
iris_id["A15"]

'setosa'

In [44]:
#También podemos usar la sintaxis:
iris_id["A1":"A20"]
#cuando usamos etiquetas del índice, el límite superior sí está incluído.

id
A1     setosa
A2     setosa
A3     setosa
A4     setosa
A5     setosa
A6     setosa
A7     setosa
A8     setosa
A9     setosa
A10    setosa
A11    setosa
A12    setosa
A13    setosa
A14    setosa
A15    setosa
A16    setosa
A17    setosa
A18    setosa
A19    setosa
A20    setosa
Name: species, dtype: object

In [43]:
iris_id["A1":"A20":2]

id
A1     setosa
A3     setosa
A5     setosa
A7     setosa
A9     setosa
A11    setosa
A13    setosa
A15    setosa
A17    setosa
A19    setosa
Name: species, dtype: object

## método .get( ) sobre una Serie

In [45]:
iris_id.get(0)

'setosa'

In [47]:
iris_id.get("A20") #EQUIVALENTE A iris_id["A20"]

'setosa'

In [48]:
iris_id.get(["A2","A6","A21"])

id
A2     setosa
A6     setosa
A21    setosa
Name: species, dtype: object

In [49]:
iris_id[["A2","A6","A21"]]

id
A2     setosa
A6     setosa
A21    setosa
Name: species, dtype: object

In [ ]:
#IMPORTANTE: si alguna llave/índice no lo encuentra, get() NO REGRESA NADA
#pARA ello podemos cambiar la condición default dentro del método:

In [50]:
iris_id.tail(3)

id
A148    virginica
A149    virginica
A150    virginica
Name: species, dtype: object

In [52]:
iris_id.get(["A2","A6","A21"], default= "este id no existe" )

id
A2     setosa
A6     setosa
A21    setosa
Name: species, dtype: object

In [53]:
iris_id.get(["A2","A6","A1121"], default= "este id no existe" )

'este id no existe'

In [54]:
google.mean()

334.31009296148767

In [55]:
google.sum()/google.count()

334.31009296148744

In [56]:
google.mode()

0    291.21
dtype: float64

In [57]:
google.describe()

count    3012.000000
mean      334.310093
std       173.187205
min        49.950000
25%       218.045000
50%       283.315000
75%       443.000000
max       782.220000
Name: Stock Price, dtype: float64

In [59]:
# para ubicar la posición del valor máximo
google.idxmax()

3011

In [60]:
google[3011] == google.max()

True

In [61]:
google.min()

49.95

In [62]:
# para ubicar el índice donde está valor mínimo.
google.idxmin()

11

In [63]:
google[11]

49.95

In [66]:
iris.value_counts(normalize = True)*100

virginica     33.333333
versicolor    33.333333
setosa        33.333333
Name: species, dtype: float64

In [67]:
iris.value_counts()/iris.count()*100

virginica     33.333333
versicolor    33.333333
setosa        33.333333
Name: species, dtype: float64

## Método apply( )

In [68]:
pd.read_csv("boston_house_prices.csv")

,id,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,A1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,A2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,A3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,A4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,A5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,A502,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,A503,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,A504,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,A505,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,A506,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [ ]:
## MEDV = valor / precio de la propiedad

In [69]:
housep = pd.read_csv("boston_house_prices.csv", usecols = ["id","MEDV"], index_col = "id", squeeze = True)
housep.head()

id
A1    24.0
A2    21.6
A3    34.7
A4    33.4
A5    36.2
Name: MEDV, dtype: float64

In [70]:
housep.describe()

count    506.000000
mean      22.532806
std        9.197104
min        5.000000
25%       17.025000
50%       21.200000
75%       25.000000
max       50.000000
Name: MEDV, dtype: float64

In [ ]:
# Definamos una función que, según el valor (MEDV) de la vivienda diga si es:
# 'bajo' si precio < 17.025
# 'medio' si precio entre 17.025 y 25
# 'alto' si precio > 25

if condicion:
    ejecuta x acción si la condición vdra
else:
    ejecuta y si cond falsa

In [71]:
def clasifica_precio(precio):
    if precio < 17.025:
        return 'bajo'
    elif precio >= 17.025 and precio < 25:
        return 'medio'
    else:
        return 'alto'

In [73]:
#para aplicarlo la función a una serie:
#nombre_serie.apply(nom_funcion):
housep.apply(clasifica_precio) # a cada elemento de la serie housep aplícale la función clasifica_precio

id
A1      medio
A2      medio
A3       alto
A4       alto
A5       alto
        ...
A502    medio
A503    medio
A504    medio
A505    medio
A506     bajo
Name: MEDV, Length: 506, dtype: object

In [ ]:
#el método apply() NO modifica la serie original, nos da una nueva.

In [74]:
housep.head()

id
A1    24.0
A2    21.6
A3    34.7
A4    33.4
A5    36.2
Name: MEDV, dtype: float64

In [75]:
#Sup queremos. multiplicar por 2 CADA ELEMENTO de la serie --> lo podemos hacer mediante una función anónima:
housep.apply(lambda x: x*2)

id
A1      48.0
A2      43.2
A3      69.4
A4      66.8
A5      72.4
        ...
A502    44.8
A503    41.2
A504    47.8
A505    44.0
A506    23.8
Name: MEDV, Length: 506, dtype: float64

## Intro a DataFrames

In [76]:
nba = pd.read_csv("nba.csv")

In [77]:
type(nba)

pandas.core.frame.DataFrame

In [78]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [ ]:
# Varios de los métodos y atributos de las series se extienden a los dataframes

In [79]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [80]:
nba.index

RangeIndex(start=0, stop=458, step=1)

In [81]:
len(nba)

458

In [82]:
nba.values

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0],
       [nan, nan, nan, ..., nan, nan, nan]], dtype=object)

In [83]:
nba.shape

(458, 9)

In [84]:
#Qué tipo de información tiene el DataFrame?
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [85]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [86]:
type(nba.dtypes)

pandas.core.series.Series

In [87]:
nba.dtypes.value_counts()

object     5
float64    4
dtype: int64

## Atributos específicos de los Dataframes

In [88]:
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [89]:
#información de los índices de los renglones y las columnas
nba.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

In [90]:
#extraer una columna de un DF
nba.Name

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [91]:
nba.Number

0       0.0
1      99.0
2      30.0
3      28.0
4       8.0
       ...
453     8.0
454    25.0
455    21.0
456    24.0
457     NaN
Name: Number, Length: 458, dtype: float64

In [ ]:
#esta forma de ver las columnas NO sirve si los nombres de las variables tienen espacio

In [92]:
nba['Name'] #esta forma sí funciona aun con espacios en los nombres de las variables

0      Avery Bradley
1        Jae Crowder
2       John Holland
3        R.J. Hunter
4      Jonas Jerebko
           ...
453     Shelvin Mack
454        Raul Neto
455     Tibor Pleiss
456      Jeff Withey
457              NaN
Name: Name, Length: 458, dtype: object

In [93]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [94]:
nba['Salary'].sum()

2159837111.0

In [95]:
nba['Salary'].mean()

4842684.105381166

In [97]:
#extraer 2 o más columnas
nba[["Weight","Age"]]

     Weight   Age
0     180.0  25.0
1     235.0  25.0
2     205.0  27.0
3     185.0  22.0
4     231.0  29.0
..      ...   ...
453   203.0  26.0
454   179.0  24.0
455   256.0  26.0
456   231.0  26.0
457     NaN   NaN

[458 rows x 2 columns]

In [98]:
nba[["Name","Team","Age"]]

              Name            Team   Age
0    Avery Bradley  Boston Celtics  25.0
1      Jae Crowder  Boston Celtics  25.0
2     John Holland  Boston Celtics  27.0
3      R.J. Hunter  Boston Celtics  22.0
4    Jonas Jerebko  Boston Celtics  29.0
..             ...             ...   ...
453   Shelvin Mack       Utah Jazz  26.0
454      Raul Neto       Utah Jazz  24.0
455   Tibor Pleiss       Utah Jazz  26.0
456    Jeff Withey       Utah Jazz  26.0
457            NaN             NaN   NaN

[458 rows x 3 columns]

In [99]:
# El orden depende de cómo se exprese en el código.
nba[["Age","Name","Team"]]

      Age           Name            Team
0    25.0  Avery Bradley  Boston Celtics
1    25.0    Jae Crowder  Boston Celtics
2    27.0   John Holland  Boston Celtics
3    22.0    R.J. Hunter  Boston Celtics
4    29.0  Jonas Jerebko  Boston Celtics
..    ...            ...             ...
453  26.0   Shelvin Mack       Utah Jazz
454  24.0      Raul Neto       Utah Jazz
455  26.0   Tibor Pleiss       Utah Jazz
456  26.0    Jeff Withey       Utah Jazz
457   NaN            NaN             NaN

[458 rows x 3 columns]

In [102]:
nba[['Age','Name']]

      Age           Name
0    25.0  Avery Bradley
1    25.0    Jae Crowder
2    27.0   John Holland
3    22.0    R.J. Hunter
4    29.0  Jonas Jerebko
..    ...            ...
453  26.0   Shelvin Mack
454  24.0      Raul Neto
455  26.0   Tibor Pleiss
456  26.0    Jeff Withey
457   NaN            NaN

[458 rows x 2 columns]

In [103]:
nba[['Age','Name']].head()

    Age           Name
0  25.0  Avery Bradley
1  25.0    Jae Crowder
2  27.0   John Holland
3  22.0    R.J. Hunter
4  29.0  Jonas Jerebko

In [104]:
cols = ['Name','Team', 'Salary']
nba[cols]

              Name            Team     Salary
0    Avery Bradley  Boston Celtics  7730337.0
1      Jae Crowder  Boston Celtics  6796117.0
2     John Holland  Boston Celtics        NaN
3      R.J. Hunter  Boston Celtics  1148640.0
4    Jonas Jerebko  Boston Celtics  5000000.0
..             ...             ...        ...
453   Shelvin Mack       Utah Jazz  2433333.0
454      Raul Neto       Utah Jazz   900000.0
455   Tibor Pleiss       Utah Jazz  2900000.0
456    Jeff Withey       Utah Jazz   947276.0
457            NaN             NaN        NaN

[458 rows x 3 columns]

In [105]:
#Definir una nueva columna llamada Sport con el valor "Basketball" en cada uno de los renglones.
nba['Sport'] = "Basketball"
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,Basketball
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,Basketball

In [106]:
#método insert() --> insertar un mismo valor para todos los renglones de una nueva columna. 
# df.insert(posicion, NOMBRE_DE_COLUMNA, valor)

nba.insert(3,'Country', 'USA')

In [107]:
nba.head()

,Name,Team,Number,Country,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,USA,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,USA,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,USA,SG,27.0,6-5,205.0,Boston University,NaN,Basketball
3,R.J. Hunter,Boston Celtics,28.0,USA,SG,22.0,6-5,185.0,Georgia State,1148640.0,Basketball
4,Jonas Jerebko,Boston Celtics,8.0,USA,PF,29.0,6-10,231.0,NaN,5000000.0,Basketball

## Broadcasting Operations

In [108]:
#Agregar una constante a todos los valores
nba.Age.add(5)

0      30.0
1      30.0
2      32.0
3      27.0
4      34.0
       ...
453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [110]:
nba['Age'] + 5

0      30.0
1      30.0
2      32.0
3      27.0
4      34.0
       ...
453    31.0
454    29.0
455    31.0
456    31.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [111]:
nba.Age

0      25.0
1      25.0
2      27.0
3      22.0
4      29.0
       ...
453    26.0
454    24.0
455    26.0
456    26.0
457     NaN
Name: Age, Length: 458, dtype: float64

In [112]:
nba['Salary'].sub(500000)

0      7230337.0
1      6296117.0
2            NaN
3       648640.0
4      4500000.0
         ...
453    1933333.0
454     400000.0
455    2400000.0
456     447276.0
457          NaN
Name: Salary, Length: 458, dtype: float64

In [114]:
#de peso en libras a kgs
nba['Weight'].mul(0.45359)  #multiplicando todos los valores de weight por 0.45xx

0       81.64620
1      106.59365
2       92.98595
3       83.91415
4      104.77929
         ...
453     92.07877
454     81.19261
455    116.11904
456    104.77929
457          NaN
Name: Weight, Length: 458, dtype: float64

In [115]:
nba['Weight in Kilograms']= nba['Weight'].mul(0.45359)
nba.head(3)

,Name,Team,Number,Country,Position,Age,Height,Weight,College,Salary,Sport,Weight in Kilograms
0,Avery Bradley,Boston Celtics,0.0,USA,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball,81.64620
1,Jae Crowder,Boston Celtics,99.0,USA,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball,106.59365
2,John Holland,Boston Celtics,30.0,USA,SG,27.0,6-5,205.0,Boston University,NaN,Basketball,92.98595

In [116]:
nba[['Weight','Age']]*2

     Weight   Age
0     360.0  50.0
1     470.0  50.0
2     410.0  54.0
3     370.0  44.0
4     462.0  58.0
..      ...   ...
453   406.0  52.0
454   358.0  48.0
455   512.0  52.0
456   462.0  52.0
457     NaN   NaN

[458 rows x 2 columns]

In [118]:
nba[['Weight','Age']]= nba[['Weight','Age']].apply(lambda x:x*2)

In [119]:
nba.head()

,Name,Team,Number,Country,Position,Age,Height,Weight,College,Salary,Sport,Weight in Kilograms
0,Avery Bradley,Boston Celtics,0.0,USA,PG,50.0,6-2,360.0,Texas,7730337.0,Basketball,81.64620
1,Jae Crowder,Boston Celtics,99.0,USA,SF,50.0,6-6,470.0,Marquette,6796117.0,Basketball,106.59365
2,John Holland,Boston Celtics,30.0,USA,SG,54.0,6-5,410.0,Boston University,NaN,Basketball,92.98595
3,R.J. Hunter,Boston Celtics,28.0,USA,SG,44.0,6-5,370.0,Georgia State,1148640.0,Basketball,83.91415
4,Jonas Jerebko,Boston Celtics,8.0,USA,PF,58.0,6-10,462.0,NaN,5000000.0,Basketball,104.77929

In [120]:
mask = nba['Position']=="PG"

In [121]:
nba[mask]

,Name,Team,Number,Country,Position,Age,Height,Weight,College,Salary,Sport,Weight in Kilograms
0,Avery Bradley,Boston Celtics,0.0,USA,PG,50.0,6-2,360.0,Texas,7730337.0,Basketball,81.64620
8,Terry Rozier,Boston Celtics,12.0,USA,PG,44.0,6-2,380.0,Louisville,1824360.0,Basketball,86.18210
9,Marcus Smart,Boston Celtics,36.0,USA,PG,44.0,6-4,440.0,Oklahoma State,3431040.0,Basketball,99.78980
11,Isaiah Thomas,Boston Celtics,4.0,USA,PG,54.0,5-9,370.0,Washington,6912869.0,Basketball,83.91415
19,Jarrett Jack,Brooklyn Nets,2.0,USA,PG,64.0,6-3,400.0,Georgia Tech,6300000.0,Basketball,90.71800
...,...,...,...,...,...,...,...,...,...,...,...,...
440,Brian Roberts,Portland Trail Blazers,2.0,USA,PG,60.0,6-1,346.0,Dayton,2854940.0,Basketball,78.47107
443,Trey Burke,Utah Jazz,3.0,USA,PG,46.0,6-1,382.0,Michigan,2658240.0,Basketball,86.63569
445,Dante Exum,Utah Jazz,11.0,USA,PG,40.0,6-6,380.0,NaN,3777720.0,Basketball,86.18210
453,Shelvin Mack,Utah Jazz,8.0,USA,PG,52.0,6-3,406.0,Butler,2433333.0,Basketball,92.07877
454,Raul Neto,Utah Jazz,25.0,USA,PG,48.0,6-1,358.0,NaN,900000.0,Basketball,81.19261

In [122]:
nba[nba['Position']=="PG"]

,Name,Team,Number,Country,Position,Age,Height,Weight,College,Salary,Sport,Weight in Kilograms
0,Avery Bradley,Boston Celtics,0.0,USA,PG,50.0,6-2,360.0,Texas,7730337.0,Basketball,81.64620
8,Terry Rozier,Boston Celtics,12.0,USA,PG,44.0,6-2,380.0,Louisville,1824360.0,Basketball,86.18210
9,Marcus Smart,Boston Celtics,36.0,USA,PG,44.0,6-4,440.0,Oklahoma State,3431040.0,Basketball,99.78980
11,Isaiah Thomas,Boston Celtics,4.0,USA,PG,54.0,5-9,370.0,Washington,6912869.0,Basketball,83.91415
19,Jarrett Jack,Brooklyn Nets,2.0,USA,PG,64.0,6-3,400.0,Georgia Tech,6300000.0,Basketball,90.71800
...,...,...,...,...,...,...,...,...,...,...,...,...
440,Brian Roberts,Portland Trail Blazers,2.0,USA,PG,60.0,6-1,346.0,Dayton,2854940.0,Basketball,78.47107
443,Trey Burke,Utah Jazz,3.0,USA,PG,46.0,6-1,382.0,Michigan,2658240.0,Basketball,86.63569
445,Dante Exum,Utah Jazz,11.0,USA,PG,40.0,6-6,380.0,NaN,3777720.0,Basketball,86.18210
453,Shelvin Mack,Utah Jazz,8.0,USA,PG,52.0,6-3,406.0,Butler,2433333.0,Basketball,92.07877
454,Raul Neto,Utah Jazz,25.0,USA,PG,48.0,6-1,358.0,NaN,900000.0,Basketball,81.19261

In [123]:
#want extraer a los de posición "PG" y con edad > 44
c1 = nba['Position']=="PG"
c2 = nba['Age'] > 44

In [125]:
c2

0       True
1       True
2       True
3      False
4       True
       ...
453     True
454     True
455     True
456     True
457    False
Name: Age, Length: 458, dtype: bool

In [130]:
nba[c1&c2]

,Name,Team,Number,Country,Position,Age,Height,Weight,College,Salary,Sport,Weight in Kilograms
0,Avery Bradley,Boston Celtics,0.0,USA,PG,50.0,6-2,360.0,Texas,7730337.0,Basketball,81.64620
11,Isaiah Thomas,Boston Celtics,4.0,USA,PG,54.0,5-9,370.0,Washington,6912869.0,Basketball,83.91415
19,Jarrett Jack,Brooklyn Nets,2.0,USA,PG,64.0,6-3,400.0,Georgia Tech,6300000.0,Basketball,90.71800
22,Shane Larkin,Brooklyn Nets,0.0,USA,PG,46.0,5-11,350.0,Miami (FL),1500000.0,Basketball,79.37825
28,Donald Sloan,Brooklyn Nets,15.0,USA,PG,56.0,6-3,410.0,Texas A&M,947276.0,Basketball,92.98595
...,...,...,...,...,...,...,...,...,...,...,...,...
436,Damian Lillard,Portland Trail Blazers,0.0,USA,PG,50.0,6-3,390.0,Weber State,4236287.0,Basketball,88.45005
440,Brian Roberts,Portland Trail Blazers,2.0,USA,PG,60.0,6-1,346.0,Dayton,2854940.0,Basketball,78.47107
443,Trey Burke,Utah Jazz,3.0,USA,PG,46.0,6-1,382.0,Michigan,2658240.0,Basketball,86.63569
453,Shelvin Mack,Utah Jazz,8.0,USA,PG,52.0,6-3,406.0,Butler,2433333.0,Basketball,92.07877
454,Raul Neto,Utah Jazz,25.0,USA,PG,48.0,6-1,358.0,NaN,900000.0,Basketball,81.19261